---
kind: type
id: T:Autodesk.Revit.DB.FailureDefinitionAccessor
source: html/2abf9897-5ebf-a3bc-d40f-46632b0159fc.htm
---
# Autodesk.Revit.DB.FailureDefinitionAccessor

A class that provides access to the details of a FailureDefinition after the definition has been defined.

## Syntax (C#)
```csharp
public class FailureDefinitionAccessor : IDisposable
```